Chapter02/SalesQuoteDemo/SalesQuoteProcess/SOA/testsuites/MIWithPriorDesignTimeKnowledge.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:start xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/MIWithPriorDesignTimeKnowledge" xmlns:ns2="http://www.mycompany.com/ns/salesquote">
            			<ns2:QuoteRequest>
                				<ns2:Summary>
                    					<ns2:OpportunityID>1001</ns2:OpportunityID>
                    					<ns2:AccountName>ABC1001</ns2:AccountName>
                    					<ns2:NewCustomer>NEW</ns2:NewCustomer>
                    					<ns2:PurchaseToDate>2011</ns2:PurchaseToDate>
                    					<ns2:Address>
                        						<ns2:Street>Miami</ns2:Street>
                        						<ns2:City>Miami</ns2:City>
                        						<ns2:State>FL</ns2:State>
                        						<ns2:Zip>33333</ns2:Zip>
                        						<ns2:Country>UK</ns2:Country>
                    </ns2:Address>
                    					<ns2:CustomerType>New</ns2:CustomerType>
                    					<ns2:Industry>IT</ns2:Industry>
                    					<ns2:SalesRepId>salesrep</ns2:SalesRepId>
                    					<ns2:SalesRepName></ns2:SalesRepName>
                    					<ns2:SalesRepContact></ns2:SalesRepContact>
                    					<ns2:ValidUntil>2014-12-12T00:00:00</ns2:ValidUntil>
                    					<ns2:TotalNetRevenue>1</ns2:TotalNetRevenue>
                    					<ns2:EffectiveDiscount>1</ns2:EffectiveDiscount>
                </ns2:Summary>
                				<ns2:ProductItem>
                    					<ns2:ProductID>1111</ns2:ProductID>
                    					<ns2:ProductName>ABC1111</ns2:ProductName>
                    					<ns2:Quantity>1</ns2:Quantity>
                    					<ns2:ListPrice>1</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>1</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>1</ns2:RequestedDiscount>
                    					<ns2:RestrictedItem>false</ns2:RestrictedItem>
                    					<ns2:ControlledAvailability>true</ns2:ControlledAvailability>
                    					<ns2:Approval>
                        						<ns2:Approver>salesrep</ns2:Approver>
                        						<ns2:Title>Mr</ns2:Title>
                        						<ns2:Approved>true</ns2:Approved>
                        						<ns2:ApprovalIsConditional>true</ns2:ApprovalIsConditional>
                        						<ns2:ApprovalNote>Approve First Item</ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>2222</ns2:ProductID>
                    					<ns2:ProductName>ABC2222</ns2:ProductName>
                    					<ns2:Quantity>2</ns2:Quantity>
                    					<ns2:ListPrice>2</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>2</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>2</ns2:RequestedDiscount>
                    					<ns2:RestrictedItem>false</ns2:RestrictedItem>
                    					<ns2:ControlledAvailability>true</ns2:ControlledAvailability>
                    					<ns2:Approval>
                        						<ns2:Approver>salesrep</ns2:Approver>
                        						<ns2:Title>Mr</ns2:Title>
                        						<ns2:Approved>true</ns2:Approved>
                        						<ns2:ApprovalIsConditional>true</ns2:ApprovalIsConditional>
                        						<ns2:ApprovalNote>Approve Second Item</ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>3333</ns2:ProductID>
                    					<ns2:ProductName>ABC3333</ns2:ProductName>
                    					<ns2:Quantity>3</ns2:Quantity>
                    					<ns2:ListPrice>3</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>3</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>3</ns2:RequestedDiscount>
                    					<ns2:RestrictedItem>false</ns2:RestrictedItem>
                    					<ns2:ControlledAvailability>true</ns2:ControlledAvailability>
                    					<ns2:Approval>
                        						<ns2:Approver>salesrep</ns2:Approver>
                        						<ns2:Title>Mr</ns2:Title>
                        						<ns2:Approved>true</ns2:Approved>
                        						<ns2:ApprovalIsConditional>true</ns2:ApprovalIsConditional>
                        						<ns2:ApprovalNote>Approve Third Item</ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>4444</ns2:ProductID>
                    					<ns2:ProductName>ABC4444</ns2:ProductName>
                    					<ns2:Quantity>4</ns2:Quantity>
                    					<ns2:ListPrice>4</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>4</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>4</ns2:RequestedDiscount>
                    					<ns2:RestrictedItem>false</ns2:RestrictedItem>
                    					<ns2:ControlledAvailability>true</ns2:ControlledAvailability>
                    					<ns2:Approval>
                        						<ns2:Approver>salesrep</ns2:Approver>
                        						<ns2:Title>Mr</ns2:Title>
                        						<ns2:Approved>false</ns2:Approved>
                        						<ns2:ApprovalIsConditional>true</ns2:ApprovalIsConditional>
                        						<ns2:ApprovalNote>Approve Fourth Item</ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:QuoteRequestStatus>NEW</ns2:QuoteRequestStatus>
                				<ns2:RecommendedDiscount>
                    					<ns2:RevenueRange>1</ns2:RevenueRange>
                    					<ns2:SuggestedDiscount>1</ns2:SuggestedDiscount>
                    					<ns2:FutureDiscountProvision>1</ns2:FutureDiscountProvision>
                </ns2:RecommendedDiscount>
            </ns2:QuoteRequest>
        </ns1:start>
    </soap:Body>
</soap:Envelope>
